app/controllers/carts_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_cart
      @cart = Cart.find(params[:id])