app/controllers/line_items_controller.rb

  def index
    @line_items = @cart.line_items.all #includes(:product). тут не пишем, в модели написали
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  ORDER BY "line_items"."created_at" ASC  [["cart_id", 6]]

  def create
    @product = Product.find(params[:product_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 21]]

  def destroy
    @line_item.destroy
---
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 2]]

    def set_line_item
      @line_item = LineItem.find(params[:id])
---
SELECT  "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", 2]]