app/controllers/products_controller.rb

  def index
    @products = Product.page(params[:page])
---
SELECT  "products".* FROM "products" LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "products"

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "price", "weight", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "f"], ["description", "f"], ["price", 12.12], ["weight", 12], ["created_at", "2015-03-05 12:26:37.080173"], ["updated_at", "2015-03-05 12:26:37.080173"]]